#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_spike_two: Refreshing state... [id=10706867]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_keycloak_pods_low: Refreshing state... [id=10703636]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_keycloak_pods_med: Refreshing state... [id=10706786]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_patroni_pods_med: Refreshing state... [id=10706792]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_elevated: Refreshing state... [id=10706870]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_patroni_pods_med: Refreshing state... [id=10706807]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.pgsql_pod_restart_prod: Refreshing state... [id=10707090]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_cpu_spike: Refreshing state... [id=10706853]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_four: Refreshing state... [id=10707091]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_two: Refreshing state... [id=10707096]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.reques_count_alert_three: Refreshing state... [id=10707097]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.ops_genie_alert: Refreshing state... [id=10707092]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.prod_filesystem_over_sixty: Refreshing state... [id=10707089]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_three: Refreshing state... [id=10707093]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test: Refreshing state... [id=10707095]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_patroni_pods_low: Refreshing state... [id=10703743]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_keycloak_pods_high: Refreshing state... [id=10705304]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_spike: Refreshing state... [id=10706858]
module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_patroni_cpu_spike: Refreshing state... [id=10706854]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_med: Refreshing state... [id=9921903]
module.eb75ad-team.sysdig_monitor_dashboard.pods_cpu: Refreshing state... [id=269435]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_log_pv_med: Refreshing state... [id=9921922]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_backup_storage_pv_usage_gt_low: Refreshing state... [id=9921936]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_spike_high: Refreshing state... [id=9921904]
module.eb75ad-team.sysdig_monitor_dashboard.pv_overall: Refreshing state... [id=269437]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_low: Refreshing state... [id=9921901]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_med: Refreshing state... [id=9921897]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pod_restarts_gte_1: Refreshing state... [id=9921905]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pods_high: Refreshing state... [id=9921906]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_high: Refreshing state... [id=9921898]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_db_pods_low: Refreshing state... [id=9921900]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_db_pv_usage_med: Refreshing state... [id=9921934]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_keycloak_pods_high: Refreshing state... [id=9921902]
module.eb75ad-team.sysdig_monitor_alert_metric.prod_backup_storage_pv_usage_gt_med: Refreshing state... [id=9921933]
module.eb75ad-team.sysdig_monitor_alert_promql.prod_db_pv_usage_low: Refreshing state... [id=9921935]
module.eb75ad-team.sysdig_monitor_dashboard.pv_usage: Refreshing state... [id=269434]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.ops_genie_alert has been deleted
  - resource "sysdig_monitor_alert_metric" "ops_genie_alert" {
      - description           = "Managed by terraform: must integrate with opsgenie to work" -> null
      - enabled               = true -> null
      - id                    = "10707092" -> null
      - metric                = "avg(min(sysdig_container_memory_used_bytes)) > 5376611859824.64" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "SSO Ops Genie test Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.name in (\"sso-keycloak-79dd4845b4-zffhf\", \"sso-pgsql-dev-0\")" -> null
      - severity              = 0 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 10 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.pgsql_pod_restart_prod has been deleted
  - resource "sysdig_monitor_alert_metric" "pgsql_pod_restart_prod" {
      - description           = "Managed by terraform: undefined" -> null
      - enabled               = false -> null
      - id                    = "10707090" -> null
      - metric                = "avg(min(kubernetes.pod.restart.count)) < 5" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "TEST SANDBOX: PGSQL pod restart Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")" -> null
      - severity              = 0 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 1 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.prod_filesystem_over_sixty has been deleted
  - resource "sysdig_monitor_alert_metric" "prod_filesystem_over_sixty" {
      - description           = "Managed by terraform: undefined" -> null
      - enabled               = false -> null
      - id                    = "10707089" -> null
      - metric                = "avg(avg(fs.used.percent)) > 60" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "TEST SANDBOX: db filesystem>60 Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")" -> null
      - severity              = 4 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 10 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.reques_count_alert_three has been deleted
  - resource "sysdig_monitor_alert_metric" "reques_count_alert_three" {
      - description           = "Managed by terraform: undefined" -> null
      - enabled               = false -> null
      - id                    = "10707097" -> null
      - metric                = "sum(timeAvg(net.http.request.count)) > 0.5" -> null
      - name                  = "TEST SANDBOX: New Metric Alert 3 Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - severity              = 0 -> null
      - trigger_after_minutes = 5 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}} SEV {{__alert_severity__}} -->MED" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test has been deleted
  - resource "sysdig_monitor_alert_metric" "request_time_alert_test" {
      - description           = "Managed by terraform: ztest 2" -> null
      - enabled               = false -> null
      - id                    = "10707095" -> null
      - metric                = "avg(sum(net.http.request.time)) < 2500000" -> null
      - name                  = "TEST SANDBOX: New Metric Alert Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - severity              = 4 -> null
      - trigger_after_minutes = 5 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}} sev: {__alert_severity__}} --> LOW" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_four has been deleted
  - resource "sysdig_monitor_alert_metric" "request_time_alert_test_four" {
      - description           = "Managed by terraform: undefined" -> null
      - enabled               = false -> null
      - id                    = "10707091" -> null
      - metric                = "sum(avg(kubernetes.pod.status.ready)) > 1" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "TEST SANDBOX: New Metric Alert 4 Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.label.statefulset in (\"sso-pgsql-dev\")" -> null
      - severity              = 6 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 10 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}  SEV {{__alert_severity__}} --> INFO" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_three has been deleted
  - resource "sysdig_monitor_alert_metric" "request_time_alert_test_three" {
      - description           = "Managed by terraform: undefined" -> null
      - enabled               = false -> null
      - id                    = "10707093" -> null
      - metric                = "avg(avg(memory.used.percent)) >= 0" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "TEST SANDBOX:\u00a0 Alert 3 last tested Jan 19 Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")" -> null
      - severity              = 0 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 10 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}} SEV {{__alert_severity__}} --->HIGH" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_two has been deleted
  - resource "sysdig_monitor_alert_metric" "request_time_alert_test_two" {
      - description           = "Managed by terraform: undefined" -> null
      - enabled               = false -> null
      - id                    = "10707096" -> null
      - metric                = "sum(timeAvg(net.http.request.count)) > 0.5" -> null
      - name                  = "TEST SANDBOX: New Metric Alert 2 Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - severity              = 2 -> null
      - trigger_after_minutes = 5 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}} SEV {{__alert_severity__}} -->MED" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_patroni_pods_med has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_dev_patroni_pods_med" {
      - description           = "Managed by terraform: Number of ready patroni pods has dropped below 3" -> null
      - enabled               = true -> null
      - id                    = "10706807" -> null
      - metric                = "sum(avg(kube_pod_sysdig_status_ready)) < 2" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "Patroni - SANDBOX - Ready Pods High Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.label.statefulset in (\"sso-pgsql-dev\")" -> null
      - severity              = 0 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 5 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_elevated has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_dev_sso_cpu_elevated" {
      - description           = "Managed by terraform: Sum of the average CPU used by SSO keycloak pods" -> null
      - enabled               = true -> null
      - id                    = "10706870" -> null
      - metric                = "sum(avg(sysdig_container_cpu_cores_used)) >= 3" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "SSO - SANDBOX - CPU usage Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\")" -> null
      - severity              = 4 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 1 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_spike has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_dev_sso_cpu_spike" {
      - description           = "Managed by terraform: Alert if sandbox over 5 CPU" -> null
      - enabled               = true -> null
      - id                    = "10706858" -> null
      - metric                = "avg(max(sysdig_container_cpu_cores_used)) > 5" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "SSO - SANDBOX - CPU Spike Over 5 Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name contains \"sso-keycloak\"" -> null
      - severity              = 0 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 5 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_spike_two has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_dev_sso_cpu_spike_two" {
      - description           = "Managed by terraform: The sum of CPU usage for keycloak pods is over 5" -> null
      - enabled               = true -> null
      - id                    = "10706867" -> null
      - metric                = "sum(avg(sysdig_container_cpu_cores_used)) > 5" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "SSO - SANDBOX - CPU over 5 Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\")" -> null
      - severity              = 0 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 5 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_keycloak_pods_low has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_keycloak_pods_low" {
      - description           = "Managed by terraform:Number of ready sso pods has dropped below acceptable level" -> null
      - enabled               = false -> null
      - id                    = "10703636" -> null
      - metric                = "sum(min(kube_pod_sysdig_status_ready)) < 2" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "SSO - SANBOX - Ready Pods Low (with silver cluster stated) Terraform" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\") and kubernetes.cluster.name in (\"silver\")" -> null
      - severity              = 4 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 1 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_patroni_pods_low has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_patroni_pods_low" {
      - description           = "Managed by terraform: Number of ready patroni pods has dropped below 3" -> null
      - enabled               = false -> null
      - id                    = "10703743" -> null
      - metric                = "sum(avg(kubernetes.pod.status.ready)) < 3" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "[DEV] SANDBOX - Patroni Ready Pods Low Terraform" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.label.statefulset in (\"sso-pgsql-dev\")" -> null
      - severity              = 4 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 5 -> null
      - version               = 2 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_cpu_spike has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_prod_cpu_spike" {
      - description           = "Managed by terraform: undefined" -> null
      - enabled               = false -> null
      - id                    = "10706853" -> null
      - metric                = "avg(max(cpu.cores.used)) > 2" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "PROD SANDBOX: CPU Spike - avg(max(cpu.cores.used)) > 2 Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")" -> null
      - severity              = 4 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 5 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_keycloak_pods_high has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_prod_keycloak_pods_high" {
      - description            = "Managed by terraform: Number of ready sso pods has dropped below acceptable level" -> null
      - enabled                = true -> null
      - id                     = "10705304" -> null
      - metric                 = "sum(max(kube_pod_sysdig_status_ready)) = 0" -> null
      - multiple_alerts_by     = [] -> null
      - name                   = "SSO - SANBOX - Ready Pods High Terraform Silver" -> null
      - notification_channels  = [
          - 70637,
        ] -> null
      - renotification_minutes = 30 -> null
      - scope                  = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\")" -> null
      - severity               = 0 -> null
      - team                   = 40481 -> null
      - trigger_after_minutes  = 1 -> null
      - version                = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_keycloak_pods_med has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_prod_keycloak_pods_med" {
      - description           = "Managed by terraform: Number of ready sso pods has dropped below acceptable level" -> null
      - enabled               = true -> null
      - id                    = "10706786" -> null
      - metric                = "sum(min(kube_pod_sysdig_status_ready)) < 1" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "SSO - SANBOX - Ready Pods Med Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\")" -> null
      - severity              = 2 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 1 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_patroni_cpu_spike has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_prod_patroni_cpu_spike" {
      - description           = "Managed by terraform: undefined" -> null
      - enabled               = false -> null
      - id                    = "10706854" -> null
      - metric                = "avg(avg(fs.used.percent)) > 85" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "PROD SANDBOX: Patroni Backup storage Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")" -> null
      - severity              = 4 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 10 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_patroni_pods_med has been deleted
  - resource "sysdig_monitor_alert_metric" "sand_prod_patroni_pods_med" {
      - description           = "Managed by terraform: Number of ready patroni pods has dropped below 3" -> null
      - enabled               = true -> null
      - id                    = "10706792" -> null
      - metric                = "sum(avg(kube_pod_sysdig_status_ready)) < 2.5" -> null
      - multiple_alerts_by    = [] -> null
      - name                  = "Patroni - SANDBOX - Ready Pods Med Terraform Silver" -> null
      - notification_channels = [
          - 70637,
        ] -> null
      - scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.label.statefulset in (\"sso-pgsql-dev\")" -> null
      - severity              = 2 -> null
      - team                  = 40481 -> null
      - trigger_after_minutes = 5 -> null
      - version               = 1 -> null

      - custom_notification {
          - title = "{{__alert_name__}} is {{__alert_status__}}" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pod_restarts_gte_1 will be created
  + resource "sysdig_monitor_alert_metric" "prod_db_pod_restarts_gte_1" {
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(avg(kube_pod_sysdig_restart_count)) >= 1"
      + multiple_alerts_by    = []
      + name                  = "[GOLD SANDBOX PROD] DB - Pod Restarts"
      + notification_channels = [
          + 47969,
        ]
      + scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"c6af30-prod\") and kubernetes.pod.label.statefulset in (\"sso-patroni\")"
      + severity              = 2
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pods_high will be created
  + resource "sysdig_monitor_alert_metric" "prod_db_pods_high" {
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(avg(kube_pod_sysdig_status_ready)) < 2"
      + multiple_alerts_by    = []
      + name                  = "[GOLD SANDBOX PROD] DB - Ready Pods High"
      + notification_channels = [
          + 47969,
        ]
      + scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"c6af30-prod\") and kubernetes.pod.label.statefulset in (\"sso-patroni\")"
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_metric.prod_db_pods_low will be created
  + resource "sysdig_monitor_alert_metric" "prod_db_pods_low" {
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(avg(kube_pod_sysdig_status_ready)) < 2.5"
      + multiple_alerts_by    = []
      + name                  = "[GOLD SANDBOX PROD] DB - Ready Pods Low"
      + notification_channels = [
          + 47969,
        ]
      + scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"c6af30-prod\") and kubernetes.pod.label.statefulset in (\"sso-patroni\")"
      + severity              = 2
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_spike_high will be created
  + resource "sysdig_monitor_alert_metric" "prod_keycloak_cpu_spike_high" {
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "avg(max(sysdig_container_cpu_cores_used)) > 5"
      + multiple_alerts_by    = []
      + name                  = "[GOLD SANDBOX PROD] SSO - CPU Spike Over 5"
      + notification_channels = [
          + 47969,
        ]
      + scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"c6af30-prod\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_high will be created
  + resource "sysdig_monitor_alert_metric" "prod_keycloak_cpu_usage_high" {
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(avg(sysdig_container_cpu_cores_used)) > 5"
      + multiple_alerts_by    = []
      + name                  = "[GOLD SANDBOX PROD] SSO - CPU Usage High"
      + notification_channels = [
          + 47969,
        ]
      + scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"c6af30-prod\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_cpu_usage_med will be created
  + resource "sysdig_monitor_alert_metric" "prod_keycloak_cpu_usage_med" {
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(avg(sysdig_container_cpu_cores_used)) >= 3"
      + multiple_alerts_by    = []
      + name                  = "[GOLD SANDBOX PROD] SSO - CPU Usage Med"
      + notification_channels = [
          + 47969,
        ]
      + scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"c6af30-prod\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_high will be created
  + resource "sysdig_monitor_alert_metric" "prod_keycloak_pods_high" {
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(min(kube_pod_sysdig_status_ready)) < 3"
      + multiple_alerts_by    = []
      + name                  = "[GOLD SANDBOX PROD] SSO - Ready Pods High"
      + notification_channels = [
          + 47969,
        ]
      + scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"c6af30-prod\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_low will be created
  + resource "sysdig_monitor_alert_metric" "prod_keycloak_pods_low" {
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(max(kube_pod_sysdig_status_ready)) < 5"
      + multiple_alerts_by    = []
      + name                  = "[GOLD SANDBOX PROD] SSO - Ready Pods Low"
      + notification_channels = [
          + 47969,
        ]
      + scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"c6af30-prod\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_metric.prod_keycloak_pods_med will be created
  + resource "sysdig_monitor_alert_metric" "prod_keycloak_pods_med" {
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(min(kube_pod_sysdig_status_ready)) < 4"
      + multiple_alerts_by    = []
      + name                  = "[GOLD SANDBOX PROD] SSO - Ready Pods Med"
      + notification_channels = [
          + 47969,
        ]
      + scope                 = "kubernetes.cluster.name in (\"gold\") and kubernetes.namespace.name in (\"c6af30-prod\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity              = 2
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_promql.prod_sso_db_pv_gt_60 will be created
  + resource "sysdig_monitor_alert_promql" "prod_sso_db_pv_gt_60" {
      + enabled               = false
      + id                    = (known after apply)
      + name                  = "[GOLD SANDBOX PROD] SSO DB PV over 60%"
      + notification_channels = []
      + promql                = "avg(kubelet_volume_stats_used_bytes{cluster=\"gold\", namespace=\"c6af30-prod\", persistentvolumeclaim=~\"storage-volume-sso-patroni-.*\"}*100 / kubelet_volume_stats_capacity_bytes{cluster=\"gold\", namespace=\"c6af30-prod\", persistentvolumeclaim=~\"storage-volume-sso-patroni-.*\"}) by (persistentvolumeclaim) > 60"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 10
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_alert_promql.prod_sso_db_pv_gt_80 will be created
  + resource "sysdig_monitor_alert_promql" "prod_sso_db_pv_gt_80" {
      + enabled               = false
      + id                    = (known after apply)
      + name                  = "[GOLD SANDBOX PROD] SSO DB PV over 80%"
      + notification_channels = []
      + promql                = "avg(kubelet_volume_stats_used_bytes{cluster=\"gold\", namespace=\"c6af30-prod\", persistentvolumeclaim=~\"storage-volume-sso-patroni-.*\"}*100 / kubelet_volume_stats_capacity_bytes{cluster=\"gold\", namespace=\"c6af30-prod\", persistentvolumeclaim=~\"storage-volume-sso-patroni-.*\"}) by (persistentvolumeclaim) > 80"
      + severity              = 2
      + team                  = (known after apply)
      + trigger_after_minutes = 10
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.c6af30-team.sysdig_monitor_dashboard.pods_cpu will be created
  + resource "sysdig_monitor_dashboard" "pods_cpu" {
      + description  = "Pods & CPU"
      + id           = (known after apply)
      + name         = "Pods & CPU"
      + public       = false
      + public_token = (known after apply)
      + version      = (known after apply)

      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 10
          + name                   = "SSO Pods Usage"
          + pos_x                  = 0
          + pos_y                  = 4
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 24

          + query {
              + promql = "avg(sum(sysdig_container_cpu_cores_used{$__scope, kube_pod_label_release='sso-keycloak'}))"
              + unit   = "number"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 4
          + name                   = "Ready DB Pods"
          + pos_x                  = 8
          + pos_y                  = 0
          + transparent_background = false
          + type                   = "number"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "sum(kube_pod_sysdig_status_ready{$__scope, kube_pod_label_release='sso-patroni'})"
              + unit   = "number"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Patroni pods are replicas of our database. We are setup to have 3 at any given time. An alert will be triggered if this fails below 3"
          + height                 = 4
          + name                   = "Ready Pod"
          + pos_x                  = 0
          + pos_y                  = 0
          + transparent_background = false
          + type                   = "number"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "sum(kube_pod_sysdig_status_ready{$__scope, kube_pod_label_release='sso-keycloak'})"
              + unit   = "number"
            }
        }

      + scope {
          + comparator = "in"
          + metric     = "kube_cluster_name"
          + value      = [
              + "gold",
            ]
          + variable   = "cluster_name"
        }
      + scope {
          + comparator = "in"
          + metric     = "kube_namespace_name"
          + value      = [
              + "c6af30-prod",
            ]
          + variable   = "namespace_name"
        }

      + share {
          + role = "ROLE_RESOURCE_EDIT"

          + member {
              + id   = 36250
              + type = "TEAM"
            }
        }
    }

  # module.c6af30-team.sysdig_monitor_dashboard.pv_overall will be created
  + resource "sysdig_monitor_dashboard" "pv_overall" {
      + description  = "Persistent Volume Overall Status"
      + id           = (known after apply)
      + name         = "Persistent Volume Overall Status"
      + public       = false
      + public_token = (known after apply)
      + version      = (known after apply)

      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 4
          + name                   = "Volume Available Bytes"
          + pos_x                  = 0
          + pos_y                  = 0
          + transparent_background = false
          + type                   = "number"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "sum(kubelet_volume_stats_available_bytes)"
              + unit   = "data"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 4
          + name                   = "Volume Capacity Bytes"
          + pos_x                  = 16
          + pos_y                  = 0
          + transparent_background = false
          + type                   = "number"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "sum(kubelet_volume_stats_capacity_bytes)"
              + unit   = "data"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 4
          + name                   = "Volume Used Bytes"
          + pos_x                  = 8
          + pos_y                  = 0
          + transparent_background = false
          + type                   = "number"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "sum(kubelet_volume_stats_used_bytes)"
              + unit   = "data"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 8
          + name                   = "Volume Capacity Bytes By Namespace"
          + pos_x                  = 8
          + pos_y                  = 12
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "avg(kubelet_volume_stats_capacity_bytes) by (namespace)"
              + unit   = "number"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 8
          + name                   = "Volume Capacity Bytes By PVC"
          + pos_x                  = 8
          + pos_y                  = 4
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "avg(kubelet_volume_stats_capacity_bytes) by (persistentvolumeclaim)"
              + unit   = "number"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 8
          + name                   = "Volume Used Bytes By Namespace"
          + pos_x                  = 0
          + pos_y                  = 12
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "avg(kubelet_volume_stats_used_bytes) by (namespace)"
              + unit   = "number"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 8
          + name                   = "Volume Used Bytes By PVC"
          + pos_x                  = 0
          + pos_y                  = 4
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "avg(kubelet_volume_stats_used_bytes) by (persistentvolumeclaim)"
              + unit   = "number"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 8
          + name                   = "Volume Used Percentage By Namespace"
          + pos_x                  = 16
          + pos_y                  = 12
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "avg(kubelet_volume_stats_used_bytes/kubelet_volume_stats_capacity_bytes) by (namespace)"
              + unit   = "percent"
            }
        }
      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 8
          + name                   = "Volume Used Percentage By PVC"
          + pos_x                  = 16
          + pos_y                  = 4
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 8

          + query {
              + promql = "avg(kubelet_volume_stats_used_bytes/kubelet_volume_stats_capacity_bytes) by (persistentvolumeclaim)"
              + unit   = "percent"
            }
        }

      + share {
          + role = "ROLE_RESOURCE_EDIT"

          + member {
              + id   = 36250
              + type = "TEAM"
            }
        }
    }

  # module.c6af30-team.sysdig_monitor_dashboard.pv_usage will be created
  + resource "sysdig_monitor_dashboard" "pv_usage" {
      + description  = "Persistent Volume Usage"
      + id           = (known after apply)
      + name         = "Persistent Volume Usage"
      + public       = false
      + public_token = (known after apply)
      + version      = (known after apply)

      + panel {
          + autosize_text          = false
          + description            = "Description"
          + height                 = 12
          + name                   = "[PROD] Volume Usage By Pod"
          + pos_x                  = 0
          + pos_y                  = 0
          + transparent_background = false
          + type                   = "timechart"
          + visible_title          = false
          + width                  = 24

          + query {
              + promql = "avg(kubelet_volume_stats_used_bytes{$__scope, persistentvolumeclaim=\"storage-volume-sso-patroni-0\"}/kubelet_volume_stats_capacity_bytes{$__scope, persistentvolumeclaim=\"storage-volume-sso-patroni-0\"} * 100)"
              + unit   = "percent"
            }
          + query {
              + promql = "avg(kubelet_volume_stats_used_bytes{$__scope, persistentvolumeclaim=\"storage-volume-sso-patroni-1\"}/kubelet_volume_stats_capacity_bytes{$__scope, persistentvolumeclaim=\"storage-volume-sso-patroni-1\"} * 100)"
              + unit   = "percent"
            }
          + query {
              + promql = "avg(kubelet_volume_stats_used_bytes{$__scope, persistentvolumeclaim=\"storage-volume-sso-patroni-2\"}/kubelet_volume_stats_capacity_bytes{$__scope, persistentvolumeclaim=\"storage-volume-sso-patroni-2\"} * 100)"
              + unit   = "percent"
            }
        }

      + scope {
          + comparator = "in"
          + metric     = "kube_namespace_name"
          + value      = [
              + "c6af30-prod",
            ]
          + variable   = "namespace_name"
        }

      + share {
          + role = "ROLE_RESOURCE_EDIT"

          + member {
              + id   = 36250
              + type = "TEAM"
            }
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.ops_genie_alert will be created
  + resource "sysdig_monitor_alert_metric" "ops_genie_alert" {
      + description           = "Managed by terraform: must integrate with opsgenie to work"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "avg(min(sysdig_container_memory_used_bytes)) > 5376611859824.64"
      + name                  = "SSO Ops Genie test Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.name in (\"sso-keycloak-79dd4845b4-zffhf\", \"sso-pgsql-dev-0\")"
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 10
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.pgsql_pod_restart_prod will be created
  + resource "sysdig_monitor_alert_metric" "pgsql_pod_restart_prod" {
      + description           = "Managed by terraform: undefined"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "avg(min(kubernetes.pod.restart.count)) < 5"
      + name                  = "TEST SANDBOX: PGSQL pod restart Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")"
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 1
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.prod_filesystem_over_sixty will be created
  + resource "sysdig_monitor_alert_metric" "prod_filesystem_over_sixty" {
      + description           = "Managed by terraform: undefined"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "avg(avg(fs.used.percent)) > 60"
      + name                  = "TEST SANDBOX: db filesystem>60 Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 10
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.reques_count_alert_three will be created
  + resource "sysdig_monitor_alert_metric" "reques_count_alert_three" {
      + description           = "Managed by terraform: undefined"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(timeAvg(net.http.request.count)) > 0.5"
      + name                  = "TEST SANDBOX: New Metric Alert 3 Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}} SEV {{__alert_severity__}} -->MED"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test will be created
  + resource "sysdig_monitor_alert_metric" "request_time_alert_test" {
      + description           = "Managed by terraform: ztest 2"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "avg(sum(net.http.request.time)) < 2500000"
      + name                  = "TEST SANDBOX: New Metric Alert Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}} sev: {__alert_severity__}} --> LOW"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_four will be created
  + resource "sysdig_monitor_alert_metric" "request_time_alert_test_four" {
      + description           = "Managed by terraform: undefined"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(avg(kubernetes.pod.status.ready)) > 1"
      + name                  = "TEST SANDBOX: New Metric Alert 4 Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.label.statefulset in (\"sso-pgsql-dev\")"
      + severity              = 6
      + team                  = (known after apply)
      + trigger_after_minutes = 10
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}  SEV {{__alert_severity__}} --> INFO"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_three will be created
  + resource "sysdig_monitor_alert_metric" "request_time_alert_test_three" {
      + description           = "Managed by terraform: undefined"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "avg(avg(memory.used.percent)) >= 0"
      + name                  = "TEST SANDBOX:\u00a0 Alert 3 last tested Jan 19 Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")"
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 10
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}} SEV {{__alert_severity__}} --->HIGH"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.request_time_alert_test_two will be created
  + resource "sysdig_monitor_alert_metric" "request_time_alert_test_two" {
      + description           = "Managed by terraform: undefined"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(timeAvg(net.http.request.count)) > 0.5"
      + name                  = "TEST SANDBOX: New Metric Alert 2 Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + severity              = 2
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}} SEV {{__alert_severity__}} -->MED"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_patroni_pods_med will be created
  + resource "sysdig_monitor_alert_metric" "sand_dev_patroni_pods_med" {
      + description           = "Managed by terraform: Number of ready patroni pods has dropped below 3"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "sum(avg(kube_pod_sysdig_status_ready)) < 2"
      + name                  = "Patroni - SANDBOX - Ready Pods High Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.label.statefulset in (\"sso-pgsql-dev\")"
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_elevated will be created
  + resource "sysdig_monitor_alert_metric" "sand_dev_sso_cpu_elevated" {
      + description           = "Managed by terraform: Sum of the average CPU used by SSO keycloak pods"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "sum(avg(sysdig_container_cpu_cores_used)) >= 3"
      + name                  = "SSO - SANDBOX - CPU usage Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 1
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_spike will be created
  + resource "sysdig_monitor_alert_metric" "sand_dev_sso_cpu_spike" {
      + description           = "Managed by terraform: Alert if sandbox over 5 CPU"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "avg(max(sysdig_container_cpu_cores_used)) > 5"
      + name                  = "SSO - SANDBOX - CPU Spike Over 5 Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name contains \"sso-keycloak\""
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_dev_sso_cpu_spike_two will be created
  + resource "sysdig_monitor_alert_metric" "sand_dev_sso_cpu_spike_two" {
      + description           = "Managed by terraform: The sum of CPU usage for keycloak pods is over 5"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "sum(avg(sysdig_container_cpu_cores_used)) > 5"
      + name                  = "SSO - SANDBOX - CPU over 5 Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity              = 0
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_keycloak_pods_low will be created
  + resource "sysdig_monitor_alert_metric" "sand_keycloak_pods_low" {
      + description           = "Managed by terraform:Number of ready sso pods has dropped below acceptable level"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(min(kube_pod_sysdig_status_ready)) < 2"
      + multiple_alerts_by    = []
      + name                  = "SSO - SANBOX - Ready Pods Low (with silver cluster stated) Terraform"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\") and kubernetes.cluster.name in (\"silver\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 1
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_patroni_pods_low will be created
  + resource "sysdig_monitor_alert_metric" "sand_patroni_pods_low" {
      + description           = "Managed by terraform: Number of ready patroni pods has dropped below 3"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "sum(avg(kubernetes.pod.status.ready)) < 3"
      + multiple_alerts_by    = []
      + name                  = "[DEV] SANDBOX - Patroni Ready Pods Low Terraform"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.label.statefulset in (\"sso-pgsql-dev\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_cpu_spike will be created
  + resource "sysdig_monitor_alert_metric" "sand_prod_cpu_spike" {
      + description           = "Managed by terraform: undefined"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "avg(max(cpu.cores.used)) > 2"
      + name                  = "PROD SANDBOX: CPU Spike - avg(max(cpu.cores.used)) > 2 Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_keycloak_pods_high will be created
  + resource "sysdig_monitor_alert_metric" "sand_prod_keycloak_pods_high" {
      + description            = "Managed by terraform: Number of ready sso pods has dropped below acceptable level"
      + enabled                = true
      + id                     = (known after apply)
      + metric                 = "sum(max(kube_pod_sysdig_status_ready)) = 0"
      + name                   = "SSO - SANBOX - Ready Pods High Terraform Silver"
      + notification_channels  = [
          + 70637,
        ]
      + renotification_minutes = 30
      + scope                  = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity               = 0
      + team                   = (known after apply)
      + trigger_after_minutes  = 1
      + version                = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_keycloak_pods_med will be created
  + resource "sysdig_monitor_alert_metric" "sand_prod_keycloak_pods_med" {
      + description           = "Managed by terraform: Number of ready sso pods has dropped below acceptable level"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "sum(min(kube_pod_sysdig_status_ready)) < 1"
      + name                  = "SSO - SANBOX - Ready Pods Med Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.deployment.name in (\"sso-keycloak\")"
      + severity              = 2
      + team                  = (known after apply)
      + trigger_after_minutes = 1
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_patroni_cpu_spike will be created
  + resource "sysdig_monitor_alert_metric" "sand_prod_patroni_cpu_spike" {
      + description           = "Managed by terraform: undefined"
      + enabled               = false
      + id                    = (known after apply)
      + metric                = "avg(avg(fs.used.percent)) > 85"
      + name                  = "PROD SANDBOX: Patroni Backup storage Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-prod\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 10
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.sand3d5c3f-team.sysdig_monitor_alert_metric.sand_prod_patroni_pods_med will be created
  + resource "sysdig_monitor_alert_metric" "sand_prod_patroni_pods_med" {
      + description           = "Managed by terraform: Number of ready patroni pods has dropped below 3"
      + enabled               = true
      + id                    = (known after apply)
      + metric                = "sum(avg(kube_pod_sysdig_status_ready)) < 2.5"
      + name                  = "Patroni - SANDBOX - Ready Pods Med Terraform Silver"
      + notification_channels = [
          + 70637,
        ]
      + scope                 = "kubernetes.namespace.name in (\"3d5c3f-dev\") and kubernetes.pod.label.statefulset in (\"sso-pgsql-dev\")"
      + severity              = 2
      + team                  = (known after apply)
      + trigger_after_minutes = 5
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named
"prod6d70e7_team_sysdig_monitor_api_token" but a value was found in file
"ci.auto.tfvars". If you meant to use this value, add a "variable" block to
the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @thegentlemanphysicist, Action: `pull_request`*